trol73/avr-make/asm/include/ATxmega192C3def.inc
; TC2_INTFLAGS masks
.equ TC2_LCMPDIF_bm = 0x80 ; Low Byte Compare D Interrupt Flag bit mask
.equ TC2_LCMPDIF_bp = 7 ; Low Byte Compare D Interrupt Flag bit position
.equ TC2_LCMPCIF_bm = 0x40 ; Low Byte Compare C Interrupt Flag bit mask
.equ TC2_LCMPCIF_bp = 6 ; Low Byte Compare C Interrupt Flag bit position
.equ TC2_LCMPBIF_bm = 0x20 ; Low Byte Compare B Interrupt Flag bit mask
.equ TC2_LCMPBIF_bp = 5 ; Low Byte Compare B Interrupt Flag bit position
.equ TC2_LCMPAIF_bm = 0x10 ; Low Byte Compare A Interrupt Flag bit mask
.equ TC2_LCMPAIF_bp = 4 ; Low Byte Compare A Interrupt Flag bit position
.equ TC2_HUNFIF_bm = 0x02 ; High Byte Underflow Interrupt Flag bit mask
.equ TC2_HUNFIF_bp = 1 ; High Byte Underflow Interrupt Flag bit position
.equ TC2_LUNFIF_bm = 0x01 ; Low Byte Underflow Interrupt Flag bit mask
.equ TC2_LUNFIF_bp = 0 ; Low Byte Underflow Interrupt Flag bit position
 
; Clock Selection
.equ TC2_CLKSEL_OFF_gc = (0x00<<0) ; Timer Off
.equ TC2_CLKSEL_DIV1_gc = (0x01<<0) ; System Clock
.equ TC2_CLKSEL_DIV2_gc = (0x02<<0) ; System Clock / 2
.equ TC2_CLKSEL_DIV4_gc = (0x03<<0) ; System Clock / 4
.equ TC2_CLKSEL_DIV8_gc = (0x04<<0) ; System Clock / 8
.equ TC2_CLKSEL_DIV64_gc = (0x05<<0) ; System Clock / 64
.equ TC2_CLKSEL_DIV256_gc = (0x06<<0) ; System Clock / 256
.equ TC2_CLKSEL_DIV1024_gc = (0x07<<0) ; System Clock / 1024
.equ TC2_CLKSEL_EVCH0_gc = (0x08<<0) ; Event Channel 0
.equ TC2_CLKSEL_EVCH1_gc = (0x09<<0) ; Event Channel 1
.equ TC2_CLKSEL_EVCH2_gc = (0x0A<<0) ; Event Channel 2
.equ TC2_CLKSEL_EVCH3_gc = (0x0B<<0) ; Event Channel 3

; Byte Mode
.equ TC2_BYTEM_NORMAL_gc = (0x00<<0) ; 16-bit mode
.equ TC2_BYTEM_BYTEMODE_gc = (0x01<<0) ; Timer/Counter operating in byte mode only (TC2)
.equ TC2_BYTEM_SPLITMODE_gc = (0x02<<0) ; Timer/Counter split into two 8-bit Counters

; High Byte Underflow Interrupt Level
.equ TC2_HUNFINTLVL_OFF_gc = (0x00<<2) ; Interrupt Disabled
.equ TC2_HUNFINTLVL_LO_gc = (0x01<<2) ; Low Level
.equ TC2_HUNFINTLVL_MED_gc = (0x02<<2) ; Medium Level
.equ TC2_HUNFINTLVL_HI_gc = (0x03<<2) ; High Level

; Low Byte Underflow Interrupt Level
.equ TC2_LUNFINTLVL_OFF_gc = (0x00<<0) ; Interrupt Disabled
.equ TC2_LUNFINTLVL_LO_gc = (0x01<<0) ; Low Level
.equ TC2_LUNFINTLVL_MED_gc = (0x02<<0) ; Medium Level
.equ TC2_LUNFINTLVL_HI_gc = (0x03<<0) ; High Level

; Low Byte Compare D Interrupt Level
.equ TC2_LCMPDINTLVL_OFF_gc = (0x00<<6) ; Interrupt Disabled
.equ TC2_LCMPDINTLVL_LO_gc = (0x01<<6) ; Low Level
.equ TC2_LCMPDINTLVL_MED_gc = (0x02<<6) ; Medium Level
.equ TC2_LCMPDINTLVL_HI_gc = (0x03<<6) ; High Level

; Low Byte Compare C Interrupt Level
.equ TC2_LCMPCINTLVL_OFF_gc = (0x00<<4) ; Interrupt Disabled
.equ TC2_LCMPCINTLVL_LO_gc = (0x01<<4) ; Low Level
.equ TC2_LCMPCINTLVL_MED_gc = (0x02<<4) ; Medium Level
.equ TC2_LCMPCINTLVL_HI_gc = (0x03<<4) ; High Level

; Low Byte Compare B Interrupt Level
.equ TC2_LCMPBINTLVL_OFF_gc = (0x00<<2) ; Interrupt Disabled
.equ TC2_LCMPBINTLVL_LO_gc = (0x01<<2) ; Low Level
.equ TC2_LCMPBINTLVL_MED_gc = (0x02<<2) ; Medium Level
.equ TC2_LCMPBINTLVL_HI_gc = (0x03<<2) ; High Level

; Low Byte Compare A Interrupt Level
.equ TC2_LCMPAINTLVL_OFF_gc = (0x00<<0) ; Interrupt Disabled
.equ TC2_LCMPAINTLVL_LO_gc = (0x01<<0) ; Low Level
.equ TC2_LCMPAINTLVL_MED_gc = (0x02<<0) ; Medium Level
.equ TC2_LCMPAINTLVL_HI_gc = (0x03<<0) ; High Level

; Timer/Counter Command
.equ TC2_CMD_NONE_gc = (0x00<<2) ; No Command
.equ TC2_CMD_RESTART_gc = (0x02<<2) ; Force Restart
.equ TC2_CMD_RESET_gc = (0x03<<2) ; Force Hard Reset

; Timer/Counter Command
.equ TC2_CMDEN_LOW_gc = (0x01<<0) ; Low Byte Timer/Counter
.equ TC2_CMDEN_HIGH_gc = (0x02<<0) ; High Byte Timer/Counter
.equ TC2_CMDEN_BOTH_gc = (0x03<<0) ; Both Low Byte and High Byte Timer/Counters


;***************************************************************************
;** AWEX - Timer/Counter Advanced Waveform Extension
;***************************************************************************/

; AWEX_CTRL masks
.equ AWEX_PGM_bm = 0x20 ; Pattern Generation Mode bit mask
.equ AWEX_PGM_bp = 5 ; Pattern Generation Mode bit position
.equ AWEX_CWCM_bm = 0x10 ; Common Waveform Channel Mode bit mask
.equ AWEX_CWCM_bp = 4 ; Common Waveform Channel Mode bit position
.equ AWEX_DTICCDEN_bm = 0x08 ; Dead Time Insertion Compare Channel D Enable bit mask
.equ AWEX_DTICCDEN_bp = 3 ; Dead Time Insertion Compare Channel D Enable bit position
.equ AWEX_DTICCCEN_bm = 0x04 ; Dead Time Insertion Compare Channel C Enable bit mask
.equ AWEX_DTICCCEN_bp = 2 ; Dead Time Insertion Compare Channel C Enable bit position
.equ AWEX_DTICCBEN_bm = 0x02 ; Dead Time Insertion Compare Channel B Enable bit mask
.equ AWEX_DTICCBEN_bp = 1 ; Dead Time Insertion Compare Channel B Enable bit position
.equ AWEX_DTICCAEN_bm = 0x01 ; Dead Time Insertion Compare Channel A Enable bit mask
.equ AWEX_DTICCAEN_bp = 0 ; Dead Time Insertion Compare Channel A Enable bit position

; AWEX_FDCTRL masks
.equ AWEX_FDDBD_bm = 0x10 ; Fault Detect on Disable Break Disable bit mask
.equ AWEX_FDDBD_bp = 4 ; Fault Detect on Disable Break Disable bit position
.equ AWEX_FDMODE_bm = 0x04 ; Fault Detect Mode bit mask
.equ AWEX_FDMODE_bp = 2 ; Fault Detect Mode bit position
.equ AWEX_FDACT_gm = 0x03 ; Fault Detect Action group mask
.equ AWEX_FDACT_gp = 0 ; Fault Detect Action group position
.equ AWEX_FDACT0_bm = (1<<0) ; Fault Detect Action bit 0 mask
.equ AWEX_FDACT0_bp = 0 ; Fault Detect Action bit 0 position
.equ AWEX_FDACT1_bm = (1<<1) ; Fault Detect Action bit 1 mask
.equ AWEX_FDACT1_bp = 1 ; Fault Detect Action bit 1 position

; AWEX_STATUS masks
.equ AWEX_FDF_bm = 0x04 ; Fault Detect Flag bit mask
.equ AWEX_FDF_bp = 2 ; Fault Detect Flag bit position
.equ AWEX_DTHSBUFV_bm = 0x02 ; Dead Time High Side Buffer Valid bit mask
.equ AWEX_DTHSBUFV_bp = 1 ; Dead Time High Side Buffer Valid bit position
.equ AWEX_DTLSBUFV_bm = 0x01 ; Dead Time Low Side Buffer Valid bit mask
.equ AWEX_DTLSBUFV_bp = 0 ; Dead Time Low Side Buffer Valid bit position

; AWEX_STATUSSET masks
; Masks for FDF aready defined
; Masks for DTHSBUFV aready defined
; Masks for DTLSBUFV aready defined
 
